import { expect, test } from "vitest";
import prettifyTitle from "./prettify-title";

[
    [
        "教你在微软模拟飞行2024回溯全球气象（24小时历史数据）",
        "教你在微软模拟飞行 2024 回溯全球气象（24小时历史数据）",
    ],
    [
        "代差！微软模拟飞行2024全新夜景对比实测（周年更新 SU04）",
        "代差！微软模拟飞行 2024 全新夜景对比实测（周年更新 SU04）",
    ],
    [
        "空客 A340-300 全流程演示：真人空管航线飞行 @ VATSIM #A343 #iniBuilds",
        "空客 A340-300 全流程演示：真人空管航线飞行 @ VATSIM #A343 #iniBuilds",
    ],
    [
        "实测 8GB 破显卡畅玩微软模拟飞行 2024 周年更新（SU04）",
        "实测 8GB 破显卡畅玩微软模拟飞行 2024 周年更新（SU04）",
    ],
    [
        "微软模拟飞行2024真正必装插件：紧凑工具栏 #DroneSim",
        "微软模拟飞行 2024 真正必装插件：紧凑工具栏 #DroneSim",
    ],
    [
        "无需插件！在微软模拟飞行2024添加3D乘客",
        "无需插件！在微软模拟飞行 2024 添加 3D 乘客",
    ],
    [
        "教你在微软模拟飞行的客舱里“走动” & 定制舱外视角",
        "教你在微软模拟飞行的客舱里“走动” & 定制舱外视角",
    ],
    [
        "iniBuilds “5APU” A340-300 评测・上手建议 @ 微软模拟飞行2024",
        "iniBuilds “5APU” A340-300 评测・上手建议 @ 微软模拟飞行 2024",
    ],
    [
        "LPV进近是啥怎么操作？导航精度堪比盲降？ #模拟飞行小知识",
        "LPV 进近是啥怎么操作？导航精度堪比盲降？ #模拟飞行小知识",
    ],
    [
        "卡顿未根治，生涯没完成，免费EC135：微软2024 SU03更新剖析",
        "卡顿未根治，生涯没完成，免费 EC135：微软 2024 SU03 更新剖析",
    ],
    [
        "微软模拟飞行2025* 开始测试： MSFS2024 SU01",
        "微软模拟飞行 2025* 开始测试：MSFS2024 SU01",
    ],
].forEach(([input, output]) => {
    test(`prettifyTitle("${input}") => "${output}"`, () => {
        expect(prettifyTitle(input)).toMatch(output);
    });
});
